from string import Template

#### تعليمات RAG ####

#### النظام #####

system_prompt = Template("\n".join([
    "أنت مساعد لتوليد إجابات للمستخدمين.",
    "سيتم تزويدك بوثائق مرتبطة باستفسار المستخدم.",
    "يجب عليك توليد إجابة بناءً على الوثائق المقدمة.",
    "تجاهل أي وثائق غير مرتبطة باستفسار المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد إجابة مناسبة.",
    "يجب أن تكون إجابتك بنفس لغة استفسار المستخدم.",
    "كن مؤدبًا ومحترمًا في إجابتك.",
    "كن دقيقًا ومختصرًا، وتجنب المعلومات غير الضرورية."
]))

#### الوثيقة ####

document_prompt = Template(
    "\n".join([
        "## رقم الوثيقة: $doc_num",
        "### المحتوى: $chunk_text"
    ])
)

#### الخاتمة ####

footer_prompt = Template("\n".join([
    "بناءً فقط على الوثائق المذكورة أعلاه، يرجى توليد إجابة للمستخدم.",
    "## الإجابة: "
]))
